```json
{
  "BTCUSD_ecn": {
    "BUY": 20,
    "SELL": 50,
    "HOLD": 30
  }
}
```

**Zdůvodnění (pro vás, ne pro odpověď v JSON):**

**Technická Analýza (Svíčkové formace a Data):**

*   **Celkový trend:** Data ukazují na klesající trend během sledovaného období. Začínáme na hodnotách kolem 111000 a končíme na hodnotách kolem 90000.
*   **Volatilita:** Vysoká volatilita v průběhu celého měsíce, s velkými rozpětími mezi high a low v mnoha 4H periodách. To naznačuje nejistotu na trhu.
*   **Svíčkové formace:** Bez detailní analýzy jednotlivých svíček (což vyžaduje pokročilejší nástroje) je těžké identifikovat jasné signály. Nicméně, dominantní klesající trend naznačuje převahu prodejců.  Navíc, vidíme více velkých červených svíček než zelených, což podporuje klesající sentiment.

**Fundamentální Analýza (Pouze hypotetická - chybí reálná data):**

*   **Předpoklad:** Abychom mohli udělat fundamentální analýzu, musíme mít reálné fundamentální data. Pro tento příklad předpokládejme, že se objevily negativní zprávy ohledně regulace kryptoměn, snížený zájem institucionálních investorů, a obavy z makroekonomického vývoje.

**Hodnocení Rizika:**

Vzhledem k výše uvedenému:

*   **SELL (50%):** Klesající trend v datech a hypotetické negativní fundamentální zprávy silně naznačují prodejní pozici. Vysoká volatilita ale znamená i riziko do budoucna.
*   **HOLD (30%):** Volatilita a nejistota (bez detailní znalosti fundamentů) naznačují, že úplné uzavření pozice by nebylo ideální. Doporučuje se sledovat vývoj a zaujmout vyčkávací pozici.
*   **BUY (20%):** Existuje malá šance na krátkodobé odrazy (bull traps), ale celkově data a předpokládané fundamenty nepodporují nákupní pozici.

**Důležité upozornění:** Toto hodnocení je založeno na *omezených* datech a *hypotetických* fundamentálních faktorech. Reálné investiční rozhodnutí by vyžadovalo důkladnou analýzu *aktuálních* fundamentálních dat a komplexnější technickou analýzu.  Toto je pouze *příklad*, jak by mohl finanční poradce přistupovat k hodnocení rizika s danými informacemi.  **Není to investiční doporučení.**
