```json
{
  "EURJPY_ecn": {
    "BUY": 30,
    "SELL": 40,
    "HOLD": 30
  }
}
```

**Zdůvodnění (vysvětlení, proč jsou hodnoty takové, jaké jsou, není zahrnuto v JSON odpovědi):**

Berte prosím na vědomí, že jde o *velmi* zjednodušenou a rizikovou analýzu založenou pouze na poskytnutých datech a obecných principech.  Skutečná investiční rozhodnutí vyžadují hloubkovou analýzu a zohlednění mnoha dalších faktorů.

* **Technická Analýza (Svíčkové formace a data):**

    *   **Celkový trend:** Data za měsíc vykazují proměnlivý trend s počátečním poklesem, následovaným růstem a následně konsolidací.
    *   **Nedávný vývoj:** Na konci dat se cena drží na vyšších úrovních, ale bez výrazného momentu. Posledních několik svíček je relativně malých, což naznačuje nerozhodnost.

* **Fundamentální analýza (pouze hypoteticky, protože reálná data nemám):**

    *   **Předpoklad:** Dejme tomu, že fundamentální analýza ukazuje na mírně posilující JPY (např. kvůli intervencím Bank of Japan nebo horšímu ekonomickému výhledu pro eurozónu).

* **Hodnocení:**

    *   **SELL (40%):**  Kombinace mírně negativního fundamentálního výhledu a absence jasného býčího signálu z dat, a fakt, že cena se drží na vyšších úrovních, indikuje možnost prodeje.
    *   **HOLD (30%):**  Kvůli celkové volatilitě a konsolidaci v posledních dnech je rozumné vyčkat na jasnější signál.
    *   **BUY (30%):** Možnost odrazu od supportů a pokračování v uptrendu (i když momentálně ne příliš silný).

**Důležité upozornění:**

*   **Časové rámce:** Tato analýza je provedena na 4H datech. Změna časového rámce by mohla vést k odlišným výsledkům.
*   **Stop-loss/Take-profit:**  Při obchodování s reálnými penězi je naprosto nezbytné používat stop-loss příkazy pro řízení rizika a take-profit příkazy pro zajištění zisku.
*   **Fundamentální data:**  Představte si, že máte aktuální data o úrokových sazbách, HDP, inflaci a dalších relevantních ukazatelích.
*   **Diverzifikace:** Nikdy nevkládejte veškerý kapitál do jednoho obchodu. Diverzifikujte své portfolio.
*   **Osobní tolerance rizika:** Uvědomte si svou vlastní toleranci rizika a investujte pouze to, co si můžete dovolit ztratit.
* **Nejedná se o investiční poradenství:** Berte toto jako ukázku procesu, nikoliv jako konkrétní doporučení k obchodování.
